import MockMsgImg from "./assets/mock-msg-img.png";

export const addressee = [
  {
    name: "Андрей",
    placeholder: "Изображение",
    time: "10:49",
  },
  {
    name: "Илья",
    placeholder:
      "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
    newMessages: 5,
    time: "12:21",
  },
  {
    name: "Андрей",
    placeholder: "Изображение",
    time: "10:49",
  },
  {
    name: "Илья",
    placeholder:
      "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
    newMessages: 5,
    time: "12:21",
  },

  {
    name: "Андрей",
    placeholder: "Изображение",
    time: "10:49",
  },
  {
    name: "Илья",
    placeholder:
      "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
    newMessages: 5,
    time: "12:21",
  },
  {
    name: "Андрей",
    placeholder: "Изображение",
    time: "10:49",
  },
  {
    name: "Илья",
    placeholder:
      "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
    newMessages: 5,
    time: "12:21",
  },
  {
    name: "Андрей",
    placeholder: "Изображение",
    time: "10:49",
  },
  {
    name: "Илья",
    placeholder:
      "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
    newMessages: 5,
    time: "12:21",
  },
];

export const dates = [
  {
    date: "19 июня",
    messages: [
      {
        content:
          "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
      },
      {
        type: "img",
        content: MockMsgImg,
      },
    ],
  },
  {
    date: "20 июня",
    messages: [
      {
        my: true,
        content:
          "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
      },
      {
        my: true,
        type: "img",
        content: MockMsgImg,
      },
    ],
  },
];
